-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Mar 26, 2019 at 12:05 AM
-- Server version: 10.0.37-MariaDB
-- PHP Version: 7.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `sharelea_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `choice`
--

CREATE TABLE `choice` (
  `choice_id` int(11) NOT NULL,
  `choice_name` varchar(100) NOT NULL,
  `video` varchar(300) NOT NULL,
  `choice_detail` varchar(100) NOT NULL,
  `choice_status` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `choice`
--

INSERT INTO `choice` (`choice_id`, `choice_name`, `video`, `choice_detail`, `choice_status`) VALUES
(1, 'พ.ร.บคอมพิวเตอร์  ', 'https://www.youtube.com/watch?v=rmy9ElX_a9k', 'ทดสอบ รายละเอียด', 0);

-- --------------------------------------------------------

--
-- Table structure for table `testing`
--

CREATE TABLE `testing` (
  `id` int(3) NOT NULL,
  `choice_id` int(10) NOT NULL,
  `question` varchar(100) NOT NULL DEFAULT '',
  `c1` varchar(100) NOT NULL DEFAULT '',
  `c2` varchar(100) NOT NULL DEFAULT '',
  `c3` varchar(100) NOT NULL DEFAULT '',
  `c4` varchar(100) NOT NULL DEFAULT '',
  `answer` int(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `testing`
--

INSERT INTO `testing` (`id`, `choice_id`, `question`, `c1`, `c2`, `c3`, `c4`, `answer`) VALUES
(2, 1, 'พระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์  พ.ศ. 2550  ว่าด้วยเรื่องอะไร', 'ความผิดเกี่ยวกับพระราชบัญญัติ', 'ความผิดเกี่ยวกับพนักงานเจ้าหน้าที่', 'ความผิดเกี่ยวกับคอมพิวเตอร์', 'ความผิดเกี่ยวกับกฎหมาย', 3),
(3, 1, 'การเข้าระบบคอมพิวเตอร์ของผู้อื่นแล้วนำข้อมูลไปเผยแพร่ให้คนอื่นรู้ มีโทษจำคุกไม่เกิน 1 ปี ปรับไม่เกิน', '20,000 บาท', '100,000 บาท', '50,000 บาท', '60,000 บาท', 1),
(4, 1, 'การเข้าไปค้นข้อมูลส่วนบุคคลที่เก็บไว้ในคอมพิวเตอร์ มีโทษจำคุกไม่เกิน 2 ปี ปรับไม่เกินกี่บาท', '100,000 บาท', '40,000 บาท', '60,000 บาท', '20,000 บาท', 2),
(5, 1, 'การปล่อยมัลแวร์ เข้าระบบคอมพิวเตอร์คนอื่น เพื่อให้การทำงานถูกระงับ ชะลอ ขัดขวาง มีโทษจำคุกไม่เกินกี่', 'จำคุกไม่เกิน 6 เดือน หรือปรับไม่เกิน 10,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 5 ปี หรือปรับไม่เกิน 100,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 2 ปี หรือปรับไม่เกิน 40,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 1 ปี หรือปรับไม่เกิน 20,000 บาท หรือทั้งจำทั้งปรับ', 2),
(6, 1, 'มาตรา 12 หากกระทำการตัดต่อ ดัดแปลง และทำความเสียหายให้กับระบบ มีโทษจำคุกไม่เกินกี่ปี ปรับไม่เกินกี่บ', 'จำคุกไม่เกิน 2 ปี หรือปรับไม่เกิน 40,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 1 ปี หรือปรับไม่เกิน 20,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 5 ปี หรือปรับไม่เกิน 200,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 10 ปี หรือปรับไม่เกิน 200,000 บาท หรือทั้งจำทั้งปรับ', 4),
(7, 1, 'การดักข้อมูลโดยมิชอบ มีโทษจำคุกไม่เกินกี่ปี ปรับไม่เกินกี่บาท', 'จำคุกไม่เกิน 3 ปี หรือปรับไม่เกิน 60,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 2 ปี หรือปรับไม่เกิน 40,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 1 ปี หรือปรับไม่เกิน 20,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 10 ปี หรือปรับไม่เกิน 200,000 บาท หรือทั้งจำทั้งปรับ', 1),
(8, 1, 'การส่งข้อมูลคอมพิวเตอร์หรือจดหมายอิเล็กทรอนิกส์แก่บุคคลอื่นโดยปกปิดหรือปลอมแปลงแหล่งที่มา เป็นการกระ', 'มาตรา 5', 'มาตรา 13', 'มาตรา 11', 'มาตรา 6', 3),
(9, 1, 'หากกระทำการตัดต่อ ดัดแปลงหรือเพิ่มเติมไม่ว่าทั้งหมดหรือบางส่วน เป็นการกระทำความผิดในมาตราใด', 'มาตรา 7', 'มาตรา 10', 'มาตรา 5', 'มาตรา 9', 4),
(12, 1, 'มาตราที่ 12 มีความผิดว่าด้วยการจำหน่าย/เผยแผ่ชุดคำสั่ง โทษจำคุกสูงสุดกี่ปี', '1 ปี', '2 ปี', '3 ปี', '4 ปี', 1),
(13, 1, 'การกระทำความผิดตามมาตรา 9 หรือมาตรา 10 (2) เกิดความเสียหายต่อข้อมูลคอมพิวเตอร์ การรักษาความมั่นค', 'จำคุก 3 – 5 ปี', 'ปรับตั้งแต่ 60,000 – 300,000 บาท', 'จำคุก 3 – 5 ปี ปรับตั้งแต่ 60,000 – 300,000 บาท', 'จำคุก 3 – 5 ปี ปรับตั้งแต่ 60,000 – 300,000 บาท หรือทั้งจำทั้งปรับ', 1),
(14, 1, 'ทำให้เกิดความตื่นตระหนกแก่ประชาชนน่าจะเกิดความเสียหายต่อความมั่นคงของประเทศ ผู้นำเข้าระบบคอมพิวเตอร์', 'จำคุกไม่เกิน 5 ปี ', 'จำคุกไม่เกิน 5 ปี หรือปรับไม่เกิน 100,000 บาท ', 'จำคุกไม่เกิน 5 ปี หรือปรับไม่เกิน 100,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 3 - 5 ปี หรือปรับไม่เกิน 100,000 บาท หรือทั้งจำทั้งปรับ', 3),
(15, 1, 'มาตราที่ 14 ผู้ใดที่กระทำความผิดต้องระวางโทษไม่เกินกี่ปี', '18 ปี', '15 ปี', '17 ปี', '16 ปี', 3),
(16, 1, 'พ.ร.บ.คอมพิวเตอร์หมวดที่ 1 ว่าด้วยเรื่องอะไร', 'ความผิดเกี่ยวกับกฎหมาย', 'ความผิดเกี่ยวกับคอมพิวเตอร์', 'ความผิดเกี่ยวกับพระราชบัญญัติ', 'ความผิดเกี่ยวกับพนักงานเจ้าหน้าที่', 2),
(17, 1, 'มาตราที่ 8 มีฐานความผิดคือการดักข้อมูลคอมพิวเตอร์มีโทษจำคุกกี่ปี', '1 ปี', '2 ปี', '3 ปี ', '5 ปี', 3),
(18, 1, 'มาตราที่ 15 มีฐานความผิดคือการตัดต่อภาพผู้อื่น มีโทษจำคุก 3 ปีปรับไม่เกินเท่าไร', '200,000 บาท', '400,000 บาท', '500,000 บาท', '600,000 บาท', 4),
(19, 1, 'มาตราที่ 10 มีความผิดฐานการรบกวนข้อมูลคอมพิวเตอร์ โทษจำคุกไม่เกินกี่ปี', '3 ปี', '4 ปี', '5 ปี ', '6 ปี', 3),
(20, 1, 'มาตราที่ 13 มีความผิดฐานเผยแผ่ข้อมูลอันไม่เหมาะสม มีโทษไม่เกินกี่ปี', '1 – 4 ปี', '1 – 5 ปี', '2 – 4 ปี', '2 – 5 ปี', 4),
(22, 1, 'พ.ร.บ. คอมพิวเตอร์มีกี่หมวด', '2 หมวด', '3 หมวด', '1 หมวด', '5 หมวด', 1),
(23, 1, 'มาตราที่ 6 ฐานความผิดว่าด้วยล่วงรู้มาตรการป้องกัน มีโทษจำคุกทั้งหมดกี่เดือน', '3 เดือน', '6 เดือน', '7 เดือน', '8 เดือน', 2),
(41, 1, 'การส่งข้อมูลคอมพิวเตอร์หรือจดหมายอิเล็กทรอนิกส์แก่บุคคลอื่นโดยปกปิดหรือปลอมแปลงแหล่งที่มาของการส่งข้', 'จำคุกไม่เกิน 3 เดือน', 'จำคุกไม่เกิน 6 เดือน', 'ปรับไม่เกิน 10,000 บาท', 'ปรับไม่เกิน 30,000 บาท', 3),
(42, 1, 'ผู้ใดเข้าถึงโดยมิชอบซึ่งระบบคอมพิวเตอร์ที่มีมาตรการป้องกันการเข้าถึงโดยเฉพาะและมาตรการนั้น  มิได้มีไ', 'จำคุกไม่เกิน 3 เดือน ปรับไม่เกิน 10,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 6 เดือน ปรับไม่เกิน 10,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 10 ปี ปรับไม่เกิน 200,000 บาท หรือทั้งจำทั้งปรับ', 2),
(43, 1, 'การเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ที่มีลักษณะอันลามกประชาชนทั่วไปอาจเข้าถึงได้ มีความผิด', 'จำคุกไม่เกิน 3 เดือน ปรับไม่เกิน 10,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 6 เดือน ปรับไม่เกิน 10,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 10 ปี ปรับไม่เกิน 200,000 บาท หรือทั้งจำทั้งปรับ', 3),
(44, 1, 'การก่อให้เกิดความเสียหายแก่ประชาชน ไม่ว่าความเสียหายนั้นจะเกิดขึ้นในทันทีหรือในภายหลัง และไม่ว่าจะเก', 'จำคุกไม่เกิน 3 เดือน ปรับไม่เกิน 10,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 6 เดือน ปรับไม่เกิน 10,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท หรือทั้งจำทั้งปรับ', 'จำคุกไม่เกิน 10 ปี ปรับไม่เกิน 200,000 บาท หรือทั้งจำทั้งปรับ', 4),
(45, 1, 'ข้อใด ไม่ใช่ ลักษณะห้องนอนของผู้สูงอายุที่ถูกต้อง', 'เว้นที่รอบๆเตียงนอน เพื่อจะเดินได้อย่างปลอดภัย', 'ควรมีเก้าอี้หนึ่งตัว เพื่อไว้แต่งตัว', 'วางตะเกียงหรือไฟฉายไว้ใกล้ที่นอนพอที่จะเอื้อมถึงได้', 'มีราวจับหลายๆอันไว้ใน ห้องนอน', 4),
(46, 1, 'ข้อใดคือ สิ่งสำคัญในการใช้ยาอย่างถูกต้องควรทำอย่างไร เพื่อให้สามารถ ใช้ยาได้อย่างถูกคน ถูกโรค ถูกขนา', 'อ่านฉลากยาให้ถี่ถ้วน ', 'รับประทานยาตาม ที่เวลาตัวเราเองสะดวก โดยไม่ได้ดูฉลากยา', 'รับประทานยาทันทีเมื่อเกิดอาการไข้ โดยไม่ได้ดูฉลากยา', 'ใช้ยาเกินขนาด ไม่รับประทานตามที่หมอบอก', 1),
(47, 1, 'ข้อใด ไม่ใช่ ความสะอาดสะอ้าน ในด้านสิ่งแวดล้อม', 'ทุกห้องควรได้รับการดูแล ไม่ควรมี เศษฝุ่น', 'ทุกห้อง อาจจะมีเศษขยะได้บ้างเล็กน้อย', 'ทุกห้องควรปลอดกลิ่นเหม็นจากสิ่งปฏิกูล', 'ทุกห้องไม่ควรมีกลิ่น ควันบุหรี่ ทินเนอร์', 2),
(48, 1, 'การเข้าระบบคอมพิวเตอร์ที่มีการป้องกันโดยมิชอบเป็นการกระทำความผิดมาตราใด', 'มาตรา 7', 'มาตรา 10', 'มาตรา 5', 'มาตรา 12', 3),
(49, 1, 'พ.ร.บ.คอมพิวเตอร์ ฉบับที่2 เป็นปีพ.ศ.ใด', '2551', '2555', '2560', '2561', 3),
(50, 1, 'การฝากร้านในเฟสบุ๊ค ไอจี ถือเป็นสแปม ต้องมีโทษปรับกี่บาท', '200,000 บาท', '3000,000 บาท', '4000,000 บาท', '500,000 บาท', 1),
(51, 1, 'ส่งSMSมาโฆษณา โดยไม่ได้รับความยอม มีโทษปรับกี่บาท', '500,000 บาท', '400,000 บาท', '300,000 บาท', '200,000 บาท', 4);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `ID` int(5) NOT NULL,
  `Username` varchar(50) NOT NULL,
  `Password` varchar(200) NOT NULL,
  `Firstname` varchar(100) NOT NULL,
  `Lastname` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `phone` text NOT NULL,
  `Userlevel` varchar(1) NOT NULL,
  `user_date` date NOT NULL,
  `session_id` varchar(50) NOT NULL,
  `Status` varchar(1) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`ID`, `Username`, `Password`, `Firstname`, `Lastname`, `email`, `phone`, `Userlevel`, `user_date`, `session_id`, `Status`) VALUES
(30, 'admin', 'Aa123456', 'admin', 'admin', '23.noop@gmail.com', '5165165165', 'A', '0000-00-00', '1476514e0f154b00cdfc68033cac8b01', 'Y'),
(44, 'User', 'Aa123456', 'GGGGMM', 'GGGGGMM', '23.noop@gmail.com', '8888888888', 'M', '0000-00-00', 'fdc1e278676cd8877f58ab2b0c3dc5c6', 'Y'),
(47, 'Siri', 'Aa123456', 'Siri', 'Yawa', 'skunkkik192022@hotmail.com', '0992016685', 'M', '0000-00-00', 'ol90m76hs9amkshvrpeujp64nf', 'Y'),
(48, 'oil', 'Oo123456', 'oil', 'oil', 'pattarapornthongket@gmail.com', '0930124286', 'M', '0000-00-00', 'v7cnb1paf8vf9bv1bbirq5hmfs', 'Y');

-- --------------------------------------------------------

--
-- Table structure for table `user_learning`
--

CREATE TABLE `user_learning` (
  `user_learning_id` int(10) NOT NULL,
  `choice_id` int(10) NOT NULL,
  `user_id` int(10) NOT NULL,
  `user_learning_bf` int(20) NOT NULL,
  `user_learning_af` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `user_learning`
--

INSERT INTO `user_learning` (`user_learning_id`, `choice_id`, `user_id`, `user_learning_bf`, `user_learning_af`) VALUES
(40, 1, 44, 5, '7'),
(41, 1, 47, 6, '5'),
(42, 1, 48, 6, '4');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `choice`
--
ALTER TABLE `choice`
  ADD PRIMARY KEY (`choice_id`);

--
-- Indexes for table `testing`
--
ALTER TABLE `testing`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `user_learning`
--
ALTER TABLE `user_learning`
  ADD PRIMARY KEY (`user_learning_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `choice`
--
ALTER TABLE `choice`
  MODIFY `choice_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `testing`
--
ALTER TABLE `testing`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `ID` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT for table `user_learning`
--
ALTER TABLE `user_learning`
  MODIFY `user_learning_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
